DARK_MODE_BG_COLOR = 'black'
BUTTON_COLOR_DARK = "#1B3F4C"
BUTTON_BORDER_COLOR_DARK = "#0E2026"
TEXTBOX_COLOR_DARK = "#343e36"
TEXTBOX_BORDER_COLOR_DARK = "#3E4C51"
BUTTON_DISABLED_DARK = "#373A39"
BUTTON_ACTIVE_DARK = "#12573F"
LABEL_COLOR_DARK = "#12573F"
BORDER_WIDTH = 2
CORNER_RADIUS = 6

EXCEL_COLOR = "#6fa8dc"

OPTIONS = {"Dance chat": (2000000029, [83919720, 700518702]),
           "Fence chat": (2000000070, [83919720, 700518702, 533656017])}

FENCE_MEMBERS = ['Дмитрий Звягин', 'Денис Бакулин', 'Яша Плеханова', 'Никита Кудряшов',
                 'Евгений Бикетов', 'Олег Терехин', 'Олег Кропачев', 'Дмитрий Батьковичь',
                 'Аполлинарий Теплинский',
                 'Иван Ященков-Гладышенко', 'Марина Новоградская', 'Егор Каргаполов', 'Екатерина Лузум',
                 'Александр Сергеевич', 'Рома Крещенок', 'Владислав Кудлай', 'Дмитрий Ляпин',
                 'Роман Тищенко', 'Вадим Левицкий', 'Дария Сильест', 'Иван Бронь', 'Арина Безуглая',
                 'Влад Пивоваров', 'Влад Напалмов', 'Иван Винокуров', 'Фёдор Берендсен',
                 'Богдан Кудинов', 'Алиса Лалетина', 'Олег Самуйлов',
                 'Дмитрий Варварский', 'Тимур Сутягин', 'Loki Laufeyond',
                 'Абракос Кадабрус', 'Людмила Одинцова', '’alina ’min', 'Влад Гаврилов',
                 'Лев Кильдишев', 'Ярослав Бабийчук']

DANCE_MEMBERS = ['Валерия Гензе', 'Андрей Кейдж', 'Виктория Замуруева', 'Георгий Чичмели', 'Ксения '
                                                                                           'Григорьева',
                 'Аполлинарий Теплинский', 'Сергей Фролов', 'Алина Марущак', 'Юра Криворучко',
                 'Яша Плеханова', 'Наташа Боева', 'Олег Терехин', 'Фёдор Берендсен', 'Дмитрий Ляпин',
                 'Дмитрий Козуб', 'Мария Березина', 'Дарья Смирнова', 'Вероника Збитнюк', 'Екатерина '
                                                                                          'Тимушева',
                 'Евгения Олейник', 'Loki Laufeyond', 'Ульяна Алонзова', 'Алина Днепровская',
                 'Даша Байбурина', 'Арина Безуглая', 'Анастасия Мелолис']
# LIGHT_MODE_BG_COLOR = 'white'
# BUTTON_COLOR_LIGHT = "#1B3F4C"
# BUTTON_BORDER_COLOR_LIGHT = "#1B3F4C"
# TEXTBOX_COLOR_LIGHT = "#343e36"
# TEXTBOX_BORDER_COLOR_LIGHT = "#3E4C51"
